In [6]:
import numpy as np
import pandas as pd
arr = np.random.randn(6,4)
print(arr)

[[ 1.02206295  0.26639687  1.42491878 -0.4832098 ]
 [-0.42902584  0.66375118 -1.254765    0.97109094]
 [-0.59043131 -0.44800292 -0.12925534  0.01278437]
 [-0.36150423 -0.33619404  1.49529299  0.87572116]
 [ 1.50052282  0.69503846 -0.77788161  0.90010113]
 [ 0.49321358 -0.47505845  0.10311893  0.42282541]]

In [3]:
arr1 = np.random.randint(24, size=(6,4))
arr1

array([[22,  4, 13, 17],
       [ 6, 20,  5, 23],
       [15, 23, 18,  9],
       [10,  2, 14, 11],
       [ 6, 23, 22, 21],
       [21,  5, 22, 14]])

In [68]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'


row = ["A", "B", "C", "D", "E", "F"]
column = ["1", '2', '3', '4']
df = pd.DataFrame(arr1, index = row, columns = column)
df2 = pd.DataFrame(arr, index = row, columns = column)
df
df["1"]["A"]

    1   2   3   4
A  22   4  13  17
B   6  20   5  23
C  15  23  18   9
D  10   2  14  11
E   6  23  22  21
F  21   5  22  14

22

In [16]:
df.head(2)

    1   2   3   4
A  22   4  13  17
B   6  20   5  23

In [17]:
df.tail(2)

    1   2   3   4
E   6  23  22  21
F  21   5  22  14

In [18]:
df.head(1)

    1  2   3   4
A  22  4  13  17

In [22]:
df.describe(include = 'all')

               1          2          3          4
count   6.000000   6.000000   6.000000   6.000000
mean   13.333333  12.833333  15.666667  15.833333
std     7.146095  10.147249   6.470446   5.528713
min     6.000000   2.000000   5.000000   9.000000
25%     7.000000   4.250000  13.250000  11.750000
50%    12.500000  12.500000  16.000000  15.500000
75%    19.500000  22.250000  21.000000  20.000000
max    22.000000  23.000000  22.000000  23.000000

In [23]:
df.to_excel("randomDataFrame.xlsx")
df.to_csv("randomDataFrame.csv")

In [24]:
df.dtypes

1    int32
2    int32
3    int32
4    int32
dtype: object

In [52]:
df.isnull()
df.isnull().sum().sum()

df

       1      2      3      4
A  False  False  False  False
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False  False  False  False
F  False  False  False  False

0

    1   2   3   4
A  22   4  13  17
B   6  20   5  23
C  15  23  18   9
D  10   2  14  11
E   6  23  22  21
F  21   5  22  14

In [70]:
df["1"]

A    22
B     6
C    15
D    10
E     6
F    21
Name: 1, dtype: int32

In [41]:
studentData = {
    'name' : ['jack', 'Riti', 'Aadi','Bhavna'],
    'age' : ["?", 30, "?",32],
    'salary':[10000,150298,75000,200000],
    'city' : ['Sydney',"Delhi", 'New york','Maryland']

}
rowlabel=['A','B','C','D']
studentData

{'name': ['jack', 'Riti', 'Aadi', 'Bhavna'],
 'age': ['?', 30, '?', 32],
 'salary': [10000, 150298, 75000, 200000],
 'city': ['Sydney', 'Delhi', 'New york', 'Maryland']}

In [48]:
df1 = pd.DataFrame(studentData, index = rowlabel)
df1
df1.isnull()
df1.isnull().sum()
df1.dtypes
df1.info()

     name age  salary      city
A    jack   ?   10000    Sydney
B    Riti  30  150298     Delhi
C    Aadi   ?   75000  New york
D  Bhavna  32  200000  Maryland

    name    age  salary   city
A  False  False   False  False
B  False  False   False  False
C  False  False   False  False
D  False  False   False  False

name      0
age       0
salary    0
city      0
dtype: int64

name      object
age       object
salary     int64
city      object
dtype: object

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, A to D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      object
 2   salary  4 non-null      int64
 3   city    4 non-null      object
dtypes: int64(1), object(3)
memory usage: 160.0+ bytes

In [50]:
df1.columns
df1.values

Index(['name', 'age', 'salary', 'city'], dtype='object')

array([['jack', '?', 10000, 'Sydney'],
       ['Riti', 30, 150298, 'Delhi'],
       ['Aadi', '?', 75000, 'New york'],
       ['Bhavna', 32, 200000, 'Maryland']], dtype=object)

In [51]:
df1['age'] == '?'

A     True
B    False
C     True
D    False
Name: age, dtype: bool

In [63]:
df2 = df1.loc[df1['age'] != '?']
df2
df1['age']

     name age  salary      city
B    Riti  30  150298     Delhi
D  Bhavna  32  200000  Maryland

A     ?
B    30
C     ?
D    32
Name: age, dtype: object